package com.example.nick.config;

import com.example.nick.service.CategoryService;
import com.example.nick.service.ExerciseService;
import org.springframework.stereotype.Component;

import javax.annotation.PostConstruct;
import java.util.ArrayList;
import java.util.List;

@Component
public class DataHolder {
    //public static List<Exercise> exerciseList=new ArrayList<>();
    private final ExerciseService exerciseService;
    private final CategoryService categoryService;

    public DataHolder(ExerciseService exerciseService, CategoryService categoryService) {
        this.exerciseService = exerciseService;
        this.categoryService = categoryService;
    }

    @PostConstruct
    public void init() {
        this.categoryService.create("Врат", "Вежбите за вратот помагаат во борбата против тврд и вкочанет врат. " +
                        "Мускулите се зајакнуваат благодарение на ослободувањето и опуштањето на мускулите во вратот.",
                "https://i.pinimg.com/originals/0d/e3/14/0de31470ee503a68b5856a4a89019deb.jpg",
                "https://static.thenounproject.com/png/1786708-200.png");

        this.categoryService.create("Грб", "Специјално одбрани вежби кои се препорачани за лица со" +
                        " искривување на 'рбетот, неправилно држење на телото или болка во било кој предел на грбот и половината.",
                "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTuNm5_iWY5fuJFMEgMR2R1DSWQDjVrUnT31Q&usqp=CAU",
                "https://img.freepik.com/free-vector/man-with-gesture-low-back-pain_81698-1496.jpg?size=626&ext=jpg");

        this.categoryService.create("Стомак", "Погледнете методи и вежби за зацврстување на стомакот кои поттикнуваат " +
                        "тренирање на попречните абдоминални мускули ги активираат околните мускули.",
                "https://clipartart.com/images/abdominals-clipart-8.jpg",
                "https://easydrawingguides.com/wp-content/uploads/2020/04/Abs-Step-09.png");

        this.categoryService.create("Раце", "Овие вежби се препорачуваат за лица кои имаат привремена парализа на рацете, " +
                        "болка во зглобовите или пак како помош при опоравување после некоја претрпена повреда во рацете.",
                "https://media.istockphoto.com/vectors/female-biceps-well-toned-elbowbent-arm-showing-progress-after-f" +
                        "itness-vector-id935265008?b=1&k=6&m=935265008&s=612x612&w=0&h=c5eZ3nwKtxMurhErY5E2xnU13KrDEwh2DL7WbeRhvG4=",
                "https://image.freepik.com/free-vector/vector-illustration-tiny-cute-cartoon-patient-man-character-broken-" +
                        "right-arm-gypsum-bandage-plastered-arm_52005-73.jpg");

        this.categoryService.create("Рамо", "Зголемувањето на силата на рамото може да ви помогне во ситуации кога треба " +
                        "да кренете работи над вашата глава. Вежбите за рамо и грб помагаат во исправен од и добро држење. ",
                "https://i.pinimg.com/474x/6f/d5/10/6fd510b38e3358b7ade0b0dac310f403.jpg",
                "https://i.pinimg.com/474x/6e/02/19/6e021922a33a597abd2f24c0db0cebac.jpg");

        this.categoryService.create("Дланки", "Сите овие вежби можат да ви помогнат да сте свесни за вашите" +
                        "прсти, дланка и зглобови. Со тоа се зголемува точноста, стабилноста и прецизноста во дланките.",
                "https://i.pinimg.com/736x/14/36/fd/1436fd11cca7dd3e349bf7171fb3c429.jpg",
                "https://i.pinimg.com/736x/10/ae/23/10ae232f59a2617d8f404821679cfc8c.jpg");

        this.categoryService.create("Нозе", "Вежбите за нозе се внимателно одбрани да помогнат на лица кои имаат проблеми како" +
                        " што се слабост во мускулите, неправилен развој во коските или пак привремен инвалидитет во нозете.",
                "https://igniterockford.files.wordpress.com/2010/11/legs.gif",
                "https://webstockreview.net/images/injury-clipart-knee-injury-5.jpg");

        this.categoryService.create("Стапала", "Ритамот на движењето е овозможен со често вежбање на стапалата. Стапалата " +
                        "стануваат силни а истовремено и мускулите во околината се зајакнуваат.",
                "https://st2.depositphotos.com/1466799/6373/v/380/depositphotos_63733423-stock-illustration-female-feet-with-red-pedicure.jpg",
                "https://media.istockphoto.com/vectors/doodle-baby-footprints-icon-in-vector-hand-drawn-baby-footprints-icon-vector-" +
                        "id1256139413?k=6&m=1256139413&s=612x612&w=0&h=eshVoZTZXexD60M6MayR2tGJdzH5lqlooNjDgzPWjU8=");

        this.categoryService.create("Истегнување", "Во оваа група на вежби се наоѓаат вежбите кои се препорачуваат за сите" +
                        " лица без разлика на попреченоста. Овие вежби помагаат во правилен развој и држење на телото како и за релаксација.",
                "https://i.pinimg.com/564x/bf/e1/6f/bfe16f33d55e59ea0842aacd64e475bb.jpg",
                "https://www.pngitem.com/pimgs/m/193-1930915_transparent-yoga-pose-png-yoga-kids-png-png.png");

        this.categoryService.create("Дишење", "Темпото и изворот на дишење претставува важен дел од вежбите" +
                        " на кој исто така треба да се обрне внимание. Вдиши-издиши техниките се во продолжение.",
                "https://coloringhome.com/coloring/Kcj/gLG/KcjgLGA9i.gif",
                "https://lh3.googleusercontent.com/proxy/x8w7MwQmSKAXEV7maICEU2i_o82lMmNbINL5S_PtElK90ap3MjHgmS" +
                        "jbr4c0m_DLrGBi8jgei3yCPxu8Om3gdqG-V-sI9UPi2m60EK7GRiiXiMCaSO6z0xs5ZnHY4bms5QimE-A");


        this.exerciseService.create("Навалување на врат напред", "Започнете ја секоја вежба со вратот во" +
                        " позиција на средната линија. Навалите на вратот ги истегнуваат мускулите на задниот дел на вратот. " +
                        " Овие вежби помагаат за намалување на тензија во вратот и овозможуваат добро држење." +
                        "За да го направите ова истегнување:\n \n" +
                        " 1. Застанете или седете во неутрална положба, а потоа повлечете ја брадата кон вратот.\n" +
                        " 2. Почувствувајте го истегнувањето во задниот дел на вратот.\n" +
                        " 3. Следно, нежно навалете ја главата нагоре кон таванот, продолжувајќи ја брадата нагоре и надвор.",
                1L, "https://www.verywellhealth.com/thmb/Uop5YvVeXJQLnEqgLT8_qU7ArdU=/1500x844/smart/" +
                        "filters:no_upscale()/Verywell-23-2696365-ChinToChest01-1897-599334f522fa3a0010622b87.gif", "", "10 пати");

        this.exerciseService.create("Завртување на глава на страна", "Вртењата на главата можат да го вратат опсегот " +
                "на движење, но на почетокот може да се извршуваат тешко и можно е да имате проблем во вртењето. Главата треба да биде " +
                "центрирана и да не биде навалена напред, назад или настрана. Оваа вежба можете да ја правите додека лежите рамно на грб" +
                " или седите. Да се сврти главата:\n \n" +
                " 1. Седнете или застанете во неутрална положба, а потоа свртете го лицето на едната страна за да погледнете преку рамото.\n" +
                " 2. Држете 5 секунди.\n" +
                " 3. Вратете ја главата во својата неутрална положба.\n" +
                " 4. Свртете ja повторно, овој пат на другата страна.\n", 1L, "https://www.verywellhealth.com/thmb/" +
                "taKjtLDviSbEU0yQnLvE2GGry2M=/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/Verywell-23-2696365-SideToSide" +
                "01-1908-59933a3fd088c00013cd036f.gif", "", "10 пати");

        this.exerciseService.create("Навалување на врат на страна", "Да се навалете странично кон вратот:\n \n" +
                " 1. Нежно свиткајте го вратот во обид да го допрете левото уво на рамото.\n" +
                " 2. Запрете кога се чувствува истегнување во десната страна на вратот.\n" +
                " 3. Држете ја положбата 20 секунди.\n" +
                " 4. Вратете се на почетната позиција.\n" +
                " 5. Повторете го над истегнување уште четири пати.\n" +
                " 6. Нежно свиткајте го вратот во обид да го допрете десното уво на рамото.\n" +
                " 7. Запрете кога се чувствува истегнување во левата страна на вратот.\n" +
                " 8. Држете ја положбата 20 секунди.\n" +
                " 9. Вратете се на почетната позиција.\n" +
                " 10. Повторете го ова истегнување уште четири пати.", 1L, "https://www.verywellhealth.com/thmb/" +
                "CUJp9SsZLCevtke-YR1m-ts0mjM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/" +
                "Verywell-23-2696365-EarToShoulder01-1912-59933a51d088c00013cd0562.gif", "", "10 пати");

        this.exerciseService.create("Подигање на карлица", "Наклонот на карлицата е вежба за секој што има болки во грбот, " +
                        "особено болка во долниот дел од грбот. Нè учи да ги користиме стомачните мускули на начин што го поддржува и издолжува " +
                        "долниот дел на грбот. За да ја направите вежбата:\n\n" +
                        " 1. Легнете на грб и свијте ги нозете во прав агол. \n" +
                        " 2. Подигнете ја карлицата колку што можете подалеку од подот и вдишете. \n" +
                        " 3. Држете 3-5 секунди.\n" +
                        " 4. Вратете ја карлицата во првобитната положба.", 2L,
                "https://www.verywellfit.com/thmb/bZu5_m_jqdBLpP02gh3UzixIBxg=/900x0/filters:no_upscale():max_bytes(150000):" +
                        "strip_icc():format(webp)/Verywell-01-2704746-Pelvic01-572-598b480703f4020010b122a6.gif",
                "", "5 пати");

        this.exerciseService.create("Лебедова поза", "Позата на лебедот ги зајакнува екстензорите на грбот." +
                        " Овие мускули се често слаби и претерано растегнати кај луѓе кои имаат болки во грбот.\n\n" +
                        " Изведете ја оваа вежба полека. За да ја направите" +
                        " вежбата:\n\n" +
                        " 1. Легнете со лицето надолу.\n" +
                        " 2. Држете ги рацете близу до телото додека со свиткани лакти и ги доведете рацете под рамената." +
                        " Рамената треба да бидат подалеку од ушите.\n" +
                        " 3. Исправете ги нозете. \n" +
                        " 4. Вдишете: Издолжете го 'рбетот, преку горниот дел од главата додека ги притискате подлактиците и " +
                        "рацете во подлогата за нагорен лак на горниот дел од телото. \n" +
                        " 5. Издишување: Вратете се во првобитна положба, издолжувајќи го 'рбетот додека торзото се враќа на подот.\n",
                2L, "https://www.verywellfit.com/thmb/acIEqUdf9GEPHvklQxadYit_bFw=/900x0/filters:no_upscale():max_bytes(150000)" +
                        ":strip_icc():format(webp)/Verywell-03-2704746-Swan01-597-598b483568e1a2001187323a.gif", "", "5 пати");

        this.exerciseService.create("Детска позиција", "За да ја направете оваа вежба следете ги следните чекори: \n" +
                        "1. Со рацете и колената на земја, спуштајте се надолу.\n" +
                        "2. Потпрете го стомакот на бутовите.\n" +
                        "3. Проширете ги рацете пред или заедно со телото со дланките свртени нагоре.\n" +
                        "4. Фокусирајте се на длабоко дишење и опуштање на сите области на напнатост или затегнатост.\n" +
                        "Држете ја оваа позиција до 1 минута.", 2L,
                "https://www.verywellfit.com/thmb/nP-iIWr5wNiyQIDJbWtf2se_d7Y=/900x0/filters:no_upscale():max_bytes(150000):" +
                        "strip_icc():format(webp)/Verywell-04-2704746-ChildsPose-598b48489abed50010aaeb62.gif",
                "", "5 пати");

        this.exerciseService.create("Абдоминално претискање", "Овие вежби се одлични за зајакнување на вашите основни " +
                        "мускули без да ставите премногу стрес на долниот дел на грбот и 'рбетот. Еве како правилно да вежбате:\n\n" +
                        " 1. Легнете на грб.\n" +
                        " 2. Свиткајте ги колената во удобна положба.\n" +
                        " 3. Ставете ги прстите зад главата или прекрстете ги рацете пред градите.\n" +
                        " 4. Свиткајте ја главата, рамената и горниот дел од грбот од подот\n" +
                        " 5. Држете го долниот дел на грбот во контакт со подот; треба да се кренете само неколку сантиметри.\n" +
                        " 6. Дишете додека станувате.\n" +
                        " 7. Држете ја оваа позиција три секунди.\n" +
                        " 8. Полека вратете се на почетната позиција.\n" +
                        "Ако чувствувате болка во грбот, консултирајте се со вашиот лекар или физикален терапевт.", 3L,
                "https://www.verywellhealth.com/thmb/b8cT6SqQhqMHikJ6DnJwpRzwb-4=/900x0/filters:no_upscale():max_bytes(150000):strip_" +
                        "icc():format(webp)/Verywell-1-2696610-AbdominalCrunch01-1853-5991f723af5d3a00114a1d7f.gif", "", "5 пати");

        this.exerciseService.create("Ниско подигање на ногата", "Ниското подигнување на ногата е предизвикувачки, " +
                        "но ефикасен начин за зајакнување на мускулите на долниот дел на стомакот. Еве како ќе го направите тоа:\n\n" +
                        " 1. Легнете на грб.\n" +
                        " 2. Свиткајте ги колената до одреден степен што ви е пријатно. Колку се исправени нозете, толку потешка ќе биде вежбата.\n" +
                        " 3. Подигнете ги стапалата околу 10 сантиметри нагоре.\n" +
                        " 4. Полека (во истото движење како лак) вратете ги нозете / стапалата на подот.", 3L,
                "https://www.verywellhealth.com/thmb/d9fYaxa-b1bx8hAVEOpOLfhdvvg=/900x0/filters:no_upscale():max_bytes(150000):strip_icc()" +
                        ":format(webp)/Verywell-2-2696610-LowAbLegRaise01-1859-5991f74668e1a20011fdc4a1.gif", "", "5 пати");

        this.exerciseService.create("Извртено седење", "Овие извртувачки стомачни се одличен начин да ги внесете вашите " +
                "странични мускули во акција и да работите правилно. Еве како ги правите:\n\n" +
                " 1. Легнете на грб.\n" +
                " 2. Свиткајте ги колената во удобна положба.\n" +
                " 3. Свиткајте ги прстите зад главата\n" +
                " 4. Навиткајте ја главата, рамената, горниот и долниот дел на грбот од подот и аголот на левиот лакт кон десното колено.\n" +
                " 5. Држете ја оваа позиција 5 секунди.\n" +
                " 6. Полека вратете се на почетната позиција.\n" +
                " 7. Навиткајте ја главата, рамената, горниот и долниот дел на грбот од подот и аголот на десниот лакт кон левото колено.\n" +
                " 8. Држете ја оваа позиција 5 секунди.\n" +
                " 9. Полека вратете се на почетната позиција.\n", 3L, "https://www.verywellhealth.com/thmb/HESqCxN6r37VSmp" +
                "OkAByJX1DjQQ=/900x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Verywell-3-2696610-TwistingSitups01-1890-" +
                "5991f7ba9abed50010ad9cc9.gif", "", "3-5 пати");

        this.exerciseService.create("Кружни движења со испружени раце", "За да ја направете овааа вежба," +
                        " 1. Раширете ги нозете во ширина на рамената.\n" +
                        " 2. Подигнете ги рацете настрана, поставете ги паралелно со земјата и стиснете ги тупаниците.\n" +
                        " 3. Започнете брзо да ги ротирате рацете во насока на стрелките на часовникот.\n" +
                        " 4. Направете 20 круга, па спуштете ги рацете и одморете се 15 секунди.\n" +
                        " 5. Повторете во обратна насока", 4L, "https://wl-sympa.cf.tsp.li/dbb/043/3c8a865085a07dd35db45dbb60.gif",
                "", "1-3 пати");

        this.exerciseService.create("Вкрстување - ножички", "За да ја направете оваа вежба," +
                        " 1. Застанете исправени со раздвоени нозе.\n" +
                        " 2. Подигнете ги рацете на страните, а потоа прекрстете ги пред вас како да ја формирате буквата \"X\".\n" +
                        " 3. Вратете се во почетната позиција.\n" +
                        " 4. Повторете го ова движење 20 пати.\n" +
                        " 5. Спуштете ги рацете 10 до 15 секунди.", 4L,
                "https://wl-sympa.cf.tsp.li/099/642/d323fa542bbff71b6714cbdbc7.gif", "", "1-3 пати");

        this.exerciseService.create("Затворање - клештички", "За да ја направете оваа вежба," +
                        " 1. Ставете ги стапалата раширени во ширина на рамото.\n" +
                        " 2. Кренете ги рацете настрана, ставајќи ги паралелно со подот и стиснете ги дланките во тупаници ако можете.\n" +
                        " 3. Потоа свиткајте ги рацете, така што тупаниците ќе бидат на исто ниво со пазувите.\n" +
                        " 4. Вратете се во почетната позиција.\n" +
                        " 5. Повторете го ова движење 20 пати.\n" +
                        " 6. Спуштете ги рацете 15 секунди.", 4L,
                "https://wl-incrivel.cf.tsp.li/b4a/006/795d7b529f82a5d972ebafcc43.gif", "", "1-3 пати");

        this.exerciseService.create("'Рбетно свртување", "За да ја направете оваа вежба:" +
                " 1. Седнете странично на стол, свртени кон лево. " +
                " 2. Завртете го торзото кон лево, држејќи се на задниот дел од столот, за спинален пресврт.\n" +
                " 3. Исправете го 'рбетот на секое вдишување и извртувајте го на секое издишување за пет вдишувања.\n" +
                " 4. Поместете ги нозете на десната страна од столот и повторете го пресвртот на десната страна. " +
                " Вежбата може да се прави во седечка или стоечка позиција. ", 5L, "https://www.verywellfit.com/thmb/" +
                "qCyEwH_HJanmWTjj-tJcfAFp-3E=/900x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Verywell-07-3567189-" +
                "SpinalTwist02-1182-5980de510d327a0011b4cec9.gif", "", "5 пати");

        this.exerciseService.create("Рамнотежа - вага", "За да ја направете оваа вежба: " +
                " 1. На издишување, отворете ги рацете со десната рака да излезе напред и левата да се врати назад.\n" +
                " 2. Наместете го левиот колк назад и свртете го торзото налево, така што ќе се порамни со предниот дел од столот.\n" +
                " 3. Погледнете преку десните врвови на прстите и држете го рамнотежа три вдишувања. " +
                " Вежбата може да се прави во седечка или стоечка позиција. ", 5L, "https://www.verywellfit.com/thmb/" +
                "Jd64m22hwTa8S7w-YI_exDkCsE8=/900x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Verywell-09-3567189-" +
                "ChairWarriorTwo-1188-5980de7cd088c0001107bd17.gif", "", "5 пати");

        this.exerciseService.create("Остро подигање на раце", "За да ја направете оваа вежба: " +
                " 1. На вдишување, кренете ги рацете кон таванот.\n" +
                " 2. Одржувајте добро држење на горниот дел од телото со раменици опуштени и исправен 'рбет природно седејќи. " +
                " 3. Зацврстете ги коските за седење на седиштето на столот и достигнете нагоре од таму. " +
                " Вежбата може да се прави во седечка или стоечка позиција. ", 5L, "https://www.verywellfit.com/thmb/" +
                "B6hC-fL8Z0LO4PqEEQlXqhdVh08=/900x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Verywell-02-3567189-" +
                "ChairRaisedHands01-1143-5980dccc03f4020010eee3db.gif", "", "5 пати");

        this.exerciseService.create("Истегнување на дланка", "Чекори: " +
                        " 1. Едната рака ставете ја исправена пред вас, лактот исправен, со рачниот зглоб и прстите свртени кон подот.\n" +
                        " 2. Раширете ги прстите малку и со другата рака ставете нежен притисок на раката свртена надолу, " +
                        "истегнувајќи ги зглобот и прстите колку што можете.\n" +
                        " 3. Кога ќе ја достигнете максималната точка на флексибилност, држете ја оваа позиција околу 20 секунди.\n" +
                        " 4. Префрлете се на другата рака и повторете. ", 6L, "https://images-prod.healthline.com/hlcmsresource/" +
                        "images/topic_centers/Fitness-Exercise/648x364_3_Wrist_Exercises_to_Prevent_Carpal_Tunnel_EXERCISE_3.gif", "",
                " 3 пати на секоја рака, минимум 3 пати дневно");

        this.exerciseService.create("Истресување", "Ова е едноставно како што звучи: истресете ги дланките" +
                " како да сте ги измиле и се обидувате да ги исушите на воздух.\n" +
                " Направете го ова на една минута или две на секој час за да не се стегнат мускулите на вашите раце " +
                "и неговиот медијален нерв во текот на денот. ", 6L, "https://www.isgnedir.com/wp-content/uploads/2018/" +
                "07/karpal-tunel-egzersiz-2.gif", "", "Една до две минути, минимум 3 пати дневно");

        this.exerciseService.create("Пајакови склекови", "Чекори: " +
                " 1. Започнете со дланките поставени заедно, споени во внатрешната страна.\n" +
                " 2. Раширете ги прстите одделно колку што можете, а потоа „закочете“ ги прстите со одделување " +
                "на дланките, но држејќи ги прстите заедно. " +
                " 3. Држете ги дланките во оваа положба 30 секунид", 6L, "https://www.isgnedir.com/wp-content/uploads/2018/07/" +
                "karpal-tunel-egzersiz.gif", "", "Минимум 3 пати дневно");

        this.exerciseService.create("Ниско подигање на нога", "Кратката вежба со ниско подигање е одличен начин" +
                " вистински да се фокусирате на правилно вежбање на вашите мускули на квадрицепс. Еве како го правите тоа:\n" +
                " 1. Легнете на грб и користете помагало (во случајов тоалет) за да го поткренете коленото нагоре.\n" +
                " 2. Полека исправете го свитканото колено додека не биде исправено.\n" +
                " 3. Затегнете го вашиот квадрицепс со прстите насочени кон таванот и држете го цврсто пет секунди.\n" +
                " 4. Полека спуштете ја ногата надолу." +
                " Повторете го истото и со другата нога", 7L, "https://www.verywellhealth.com/thmb/YR1bE1F-" +
                "DpSnkn1M1w0mwwIyxsw=/900x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Verywell-02-2696617-" +
                "ShortArcQuads01-SM-5979fb1303f4020010f431d2.gif", "", "5-10 пати");

        this.exerciseService.create("Странично движење со ластик", "Вежбата за страничнo движење со ластик ги зајакнува" +
                        " мускулите на страната на колковите познати како глутеус медиус. Овие мускули се важни за одржување на стабилноста при" +
                        " одење и трчање. Tреба да набавите лента со латекс или ластик за да ја изведете оваа вежба.\n" +
                        "Врзете ја лентата за терапија во јамка. Ставете ги двете нозе во внатрешноста на јамката и застанете. " +
                        "Отворете ги широко нозете за да ја натегнете лентата. Правете мали чекори настрана. ", 7L,
                "https://www.verywellhealth.com/thmb/ygf5Q30XtY8Ej6ts4Z4kmrYE4s0=/900x0/filters:no_upscale():max_bytes(150000)" +
                        ":strip_icc():format(webp)/Verywell-25-2696611-LateralBandWalk01-1843-5993448d0d327a001068c4af.gif",
                "", "5-10 пати");

        this.exerciseService.create("Високо подигање на нога", "Оваа вежба е слична како првата но се изведува " +
                "без помагало. Легнете на грб, свиткајте го едното колено, затегнете го квадрицепсот и подигнете ја ногата нагоре" +
                " колку можете повисоко. Истото повторете го и со другата нога. ", 7L, "https://www.verywellhealth." +
                "com/thmb/qRL3ay8We_PnGNqGsMzzK-liH9s=/900x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/" +
                "Verywell-27-2696517-StraightLegRaise01-1954-59934a65c412440011d1e10a.gif", "", "5-10 пати");

        this.exerciseService.create("Дорзифлексија", "Дорзифлексија на глуждот е движење на свиткување на глуждот " +
                        "нагоре кон коската. Добивањето на ова движење може да ви помогне да одите нормално. " +
                        "Еве како да добиете повеќе дорзилексија на глуждот:\n" +
                        " 1. Движејќи го само глуждот, насочете го стапалото назад кон вашиот нос (додека ги држите колената исправени). " +
                        "Продолжете сè додека не почувствувате непријатност или не можете повеќе да го навалите назад.\n" +
                        " 2. Држете ја оваа позиција 15 секунди.\n" +
                        " 3. Вратете се во неутрална положба и повторете со другото стапало. ", 8L,
                "https://www.verywellhealth.com/thmb/g45xn0zuXY4_CcNYcMbUev_olC8=/900x0/filters:no_upscale():max_bytes(150000)" +
                        ":strip_icc():format(webp)/Verywell-01-2696480-Dorisflexion-598ca2a40d327a0010eb724e.gif", "", "10 пати");

        this.exerciseService.create("Внатрешно / надворешно вртење", "Оваа вежба се изведува со движење на глуждот кон " +
                "надворешниот/страничниот или внатрешниот дел на ногата. Изведете ја оваа вежба за да добиете движење на еверзија во глуждот:\n" +
                " 1. Движејќи го само глуждот и држејќи ги прстите насочени, свртете ја ногата нанадвор, подалеку од другата нога. " +
                "Продолжете сè додека не се почувствува непријатност или повеќе не можете да ја свртите ногата нанадвор.\n" +
                " 2. Држете ја оваа позиција 15 секунди.\n" +
                " 3. Вратете се во неутрална позиција. " +
                " 4. Движејќи го глуждот, свртејте ја ногата навнатре, поблиску кон другата нога колку можете повеќе." +
                " Повторете со другата нога", 8L, "https://www.verywellhealth.com/thmb/4PxCcCau2kd2nD0WeJhMAuDcDws=/" +
                "900x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Verywell-02-2696480-Eversion-598ca56b9abed50010498" +
                "fad.gif", "", "10 пати");
        
        this.exerciseService.create("Плантарна флексија", "Плантарна флексија е движење на насочување на глуждот" +
                " надолу и подалеку од вас. Еве како да добиете опсег на движење на плантарна флексија на глуждот (ROM):\n" +
                " 1. Движејќи го само глуждот, насочете го стапалото напред (додека ги држите колената исправени). " +
                "Продолжете сè додека не почувствувате непријатност или не можете да го поместите понатаму.\n" +
                " 2. Држете ја оваа позиција 15 секунди.\n" +
                " 3. Вратете се во неутрална позиција и повторете со другото стапало. ", 8L, "https://www." +
                "verywellhealth.com/thmb/XiWorgtvFQQClrvnbG2QW_NuEV4=/900x0/filters:no_upscale():max_bytes(150000):strip_icc():format" +
                "(webp)/Verywell-02-2696480-PlantarFlexion-598ca2f822fa3a0010e6452d.gif", "", "10 пати");


        this.exerciseService.create("Исправен Лебед", "За да ја направете оваа вежба следете ги следните чекори: \n" +
                        "1. Легнете на стомак и ставете ги рацете рамно под рамената.\n" +
                        "2. Свиткајте ги лактите за вашите страни и нежно подигнете ја главата и градите, држејќи ги колковите " +
                        "и препоните на креветот.\n" +
                        "3. Не заборавајте да ги опуштите вратот и рамената. Држете го истегнувањето 15-20 секунди " +
                        "и кога сте подготвени, нежно спуштете се надолу.\n Оваа вежба е за истегнување на грбот."
                , 9L,
                "https://www.verywellfit.com/thmb/aNkiqfbVAUzQax2jl-99y0vqJqo=/900x0/filters:no_upscale():max_bytes" +
                        "(150000):strip_icc():format(webp)/Verywell-03-2704746-Swan01-597-598b483568e1a2001187323a-59a57a48d088c000114e18b3.gif",
                "", "2 пати");

        this.exerciseService.create("Странично истегнување", "За да ја направете оваа вежба следете ги следните чекори: \n" +
                        "1. Лежејќи на грб, подигнете го едното колено и нежно превртете го на спротивната страна. Осигурете се дека " +
                        "и двете рамена остануваат во контакт со подлогата постојано..\n" +
                        "2. Треба да го почувствувате истегнувањето на страните на горниот дел од телото и долниот дел на грбот.\n" +
                        "3. Дишете длабоко и повторете го на спротивната страна.\n"
                , 9L,
                "https://www.verywellfit.com/thmb/3TEbXpzrpMJwy0A4RlhA3zQCQ04=/1500x844/smart/filters:no_upscale()/" +
                        "Verywell-20-4023748-SpinalTwist01-1729-5995b536845b340010c016cf.gif",
                "https://www.verywellfit.com/thmb/3TEbXpzrpMJwy0A4RlhA3zQCQ04=/1500x844/smart/filters:no_upscale()" +
                        "/Verywell-20-4023748-SpinalTwist01-1729-5995b536845b340010c016cf.gif", "по 30 секунди на секоја страна");

        this.exerciseService.create("Исчекор со истегнување", "За да ја направете оваа вежба следете ги следните чекори: " +
                " 1. Започнете во положба на движење напред и испуштете го левото колено.\n" +
                " 2. Ставете го десниот лакт на внатрешноста на десното колено како на сликата.\n" +
                " 3. Допрете го десниот лакт во десното колено и извртете го торзото налево.\n" +
                " 4. Достигнете ја левата рака зад вас додека не почувствувате нежно истегнување во долниот дел на грбот " +
                "и десната препона.\n" +
                " 5. Држете околу 20 до 30 секунди, ослободете се и повторете го на другата нога.\n" +
                "Можете да го измените овој потег врз основа на вашата анатомија, флексибилност и ограничувања. Вежбата е за истегнување" +
                " на колкови, препони и долниот дел од грбот", 9L, "https://www.verywellfit.com/thmb/4qi1_" +
                "y80W7sr1fUkj1SpJEr5L78=/900x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Verywell-04-3120314-" +
                "HipOpener01-209-599d8a2f519de2001121bf9a.gif", "", "2-3 пати");

        this.exerciseService.create("Енергично дишење", "Оваа техника е за регулирање на протокот на енергија низ телото. " +
                "Помага и при истегнување на вратот, област која честопати ја задржува напнатоста и се закопчува од гледање на екраните" +
                " цел ден.\n" +
                "1. Ставете ги рацете на колена со дланките свртени нагоре. Вдишете така што вашите бели дробови се полни околу две третини," +
                " а потоа задржете го здивот.\n" +
                "2. Спуштете ја брадата надолу и повлечете ја поблиску до градите правејќи двојна брада. Во исто време, подигнете ја " +
                "градната коска кон брадата. Опуштете ги рамената подалеку од ушите и уживајте во тишината.\n" +
                "3. Држете онолку колку што е пријатно, а потоа подигнете ја брадата нагоре и завршете го вдишувањето пред да го " +
                "ослободите здивот. ",10L, "https://www.becarehealth.com/wp-content/uploads/2019/04/yoga-burn-" +
                "meditation-solution.gif", "", "10 пати");

        this.exerciseService.create("Латерално дишење", "Во оваа техника, го носете здивот нагоре од долниот" +
                " дел на стомакот и се фокусирате на пренасочување на здивот во задниот дел од телото и страните на градниот кош. " +
                "Користете ја оваа вежба за да се обучите за латерално дишење." +
                "1. Седнете удобно.\n" +
                "2. Ставете ги рацете на страните на телото околу половината.\n" +
                "3. Длабоко вдишете низ носот и исправете се. " +
                "4. Запомнете дека вашите бели дробови седат во внатрешноста на трупот и ребрата можат да се шират со секој здив. " +
                "5. Издишете преку устата. Ребрата ќе се контрахираат и рацете ќе се повлечат едни кон други.", 10L, "https://www.verywellfit.com/thmb/mczi5sUulFmEN_uCx5xRkze3fSM=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/16-2704659-Lateral-BreathingGIF-e8ca1766f0d840b4a4d836b74a67a518.gif", "", "10 пати");

        this.exerciseService.create("Медитеранско дишење", "Оваа техника покрај тоа што ви го регулира дишењето, " +
                "исто така ги вклучува вашите раце. Седнете или застанете во позиција за одмарање, допрете ги внатрешните делови од " +
                "вашите дланки една со друга и вдишете и издишете подолго време задржувајќи го здивот 5-10 секунди." +
                " Регулирањето на дишењето помага многу при изведувањето на вежбите. ", 10L,
                "https://www.verywellfit.com/thmb/hpjA45LZ3k83Xna3ThBDJHwhtMU=/768x0/filters:no_upscale():" +
                        "max_bytes(150000):strip_icc():format(webp)/26-3566797-Throat-Lock-GIF-a96684d1ab734aff9d19e6430f808f72.gif",
                "", "10 пати");

    }
}
