package com.example.nick.config;

import com.example.nick.service.CategoryService;
import com.example.nick.service.DiseaseService;
import com.example.nick.service.ExerciseService;
import org.springframework.stereotype.Component;

import javax.annotation.PostConstruct;

@Component
public class DataHolder {
    //public static List<Exercise> exerciseList=new ArrayList<>();
    private final ExerciseService exerciseService;
    private final CategoryService categoryService;
    private final DiseaseService diseaseService;

    public DataHolder(ExerciseService exerciseService, CategoryService categoryService, DiseaseService diseaseService) {
        this.exerciseService = exerciseService;
        this.categoryService = categoryService;
        this.diseaseService = diseaseService;
    }

    @PostConstruct
    public void init() {
        this.categoryService.create("Врат", "Вежбите за вратот помагаат во борбата против тврд и вкочанет врат. " +
                        "Мускулите се зајакнуваат благодарение на ослободувањето и опуштањето на мускулите во вратот.",
                "https://i.pinimg.com/originals/0d/e3/14/0de31470ee503a68b5856a4a89019deb.jpg",
                "https://static.thenounproject.com/png/1786708-200.png");

        this.categoryService.create("Грб", "Специјално одбрани вежби кои се препорачани за лица со" +
                        " искривување на 'рбетот, неправилно држење на телото или болка во било кој предел на грбот и половината.",
                "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTuNm5_iWY5fuJFMEgMR2R1DSWQDjVrUnT31Q&usqp=CAU",
                "https://img.freepik.com/free-vector/man-with-gesture-low-back-pain_81698-1496.jpg?size=626&ext=jpg");

        this.categoryService.create("Стомак", "Погледнете методи и вежби за зацврстување на стомакот кои поттикнуваат " +
                        "тренирање на попречните абдоминални мускули ги активираат околните мускули.",
                "https://clipartart.com/images/abdominals-clipart-8.jpg",
                "https://easydrawingguides.com/wp-content/uploads/2020/04/Abs-Step-09.png");

        this.categoryService.create("Раце", "Овие вежби се препорачуваат за лица кои имаат привремена парализа на рацете, " +
                        "болка во зглобовите или пак како помош при опоравување после некоја претрпена повреда во рацете.",
                "https://media.istockphoto.com/vectors/female-biceps-well-toned-elbowbent-arm-showing-progress-after-f" +
                        "itness-vector-id935265008?b=1&k=6&m=935265008&s=612x612&w=0&h=c5eZ3nwKtxMurhErY5E2xnU13KrDEwh2DL7WbeRhvG4=",
                "https://image.freepik.com/free-vector/vector-illustration-tiny-cute-cartoon-patient-man-character-broken-" +
                        "right-arm-gypsum-bandage-plastered-arm_52005-73.jpg");

        this.categoryService.create("Рамо", "Зголемувањето на силата на рамото може да ви помогне во ситуации кога треба " +
                        "да кренете работи над вашата глава. Вежбите за рамо и грб помагаат во исправено и добро држење. ",
                "https://i.pinimg.com/474x/6f/d5/10/6fd510b38e3358b7ade0b0dac310f403.jpg",
                "https://i.pinimg.com/474x/6e/02/19/6e021922a33a597abd2f24c0db0cebac.jpg");

        this.categoryService.create("Дланки", "Сите овие вежби можат да ви помогнат да сте свесни за вашите" +
                        "прсти, дланка и зглобови. Со тоа се зголемува точноста, стабилноста и прецизноста во дланките.",
                "https://i.pinimg.com/736x/14/36/fd/1436fd11cca7dd3e349bf7171fb3c429.jpg",
                "https://i.pinimg.com/736x/10/ae/23/10ae232f59a2617d8f404821679cfc8c.jpg");

        this.categoryService.create("Нозе", "Вежбите за нозе се внимателно одбрани да помогнат на лица кои имаат проблеми како" +
                        " што се слабост во мускулите, неправилен развој во коските или пак привремен инвалидитет во нозете.",
                "https://igniterockford.files.wordpress.com/2010/11/legs.gif",
                "https://webstockreview.net/images/injury-clipart-knee-injury-5.jpg");

        this.categoryService.create("Стапала", "Ритамот на движењето е овозможен со често вежбање на стапалата. Стапалата " +
                        "стануваат силни а истовремено и мускулите во околината се зајакнуваат.",
                "https://st2.depositphotos.com/1466799/6373/v/380/depositphotos_63733423-stock-illustration-female-feet-with-red-pedicure.jpg",
                "https://media.istockphoto.com/vectors/doodle-baby-footprints-icon-in-vector-hand-drawn-baby-footprints-icon-vector-" +
                        "id1256139413?k=6&m=1256139413&s=612x612&w=0&h=eshVoZTZXexD60M6MayR2tGJdzH5lqlooNjDgzPWjU8=");

        this.categoryService.create("Истегнување", "Во оваа група на вежби се наоѓаат вежбите кои се препорачуваат за сите" +
                        " лица без разлика на попреченоста. Овие вежби помагаат во правилен развој и држење на телото како и за релаксација.",
                "https://i.pinimg.com/564x/bf/e1/6f/bfe16f33d55e59ea0842aacd64e475bb.jpg",
                "https://www.pngitem.com/pimgs/m/193-1930915_transparent-yoga-pose-png-yoga-kids-png-png.png");

        this.categoryService.create("Дишење", "Темпото и изворот на дишење претставува важен дел од вежбите" +
                        " на кој исто така треба да се обрне внимание. Вдиши-издиши техниките се во продолжение.",
                "https://coloringhome.com/coloring/Kcj/gLG/KcjgLGA9i.gif",
                "https://lh3.googleusercontent.com/proxy/x8w7MwQmSKAXEV7maICEU2i_o82lMmNbINL5S_PtElK90ap3MjHgmS" +
                        "jbr4c0m_DLrGBi8jgei3yCPxu8Om3gdqG-V-sI9UPi2m60EK7GRiiXiMCaSO6z0xs5ZnHY4bms5QimE-A");


        this.exerciseService.create("Навалување на врат напред", "Започнете ја секоја вежба со вратот во" +
                        " позиција на средната линија. Навалите на вратот ги истегнуваат мускулите на задниот дел на вратот. " +
                        " Овие вежби помагаат за намалување на тензија во вратот и овозможуваат добро држење." +
                        "За да го направите ова истегнување:\n \n" +
                        " 1. Застанете или седете во неутрална положба, а потоа повлечете ја брадата кон вратот.\n" +
                        " 2. Почувствувајте го истегнувањето во задниот дел на вратот.\n" +
                        " 3. Следно, нежно навалете ја главата нагоре кон таванот, продолжувајќи ја брадата нагоре и надвор.",
                1L, "https://www.verywellhealth.com/thmb/Uop5YvVeXJQLnEqgLT8_qU7ArdU=/1500x844/smart/" +
                        "filters:no_upscale()/Verywell-23-2696365-ChinToChest01-1897-599334f522fa3a0010622b87.gif", "", "10 пати");

        this.exerciseService.create("Завртување на глава на страна", "Вртењата на главата можат да го вратат опсегот " +
                "на движење, но на почетокот може да се извршуваат тешко и можно е да имате проблем во вртењето. Главата треба да биде " +
                "центрирана и да не биде навалена напред, назад или настрана. Оваа вежба можете да ја правите додека лежите рамно на грб" +
                " или седите. Да се сврти главата:\n \n" +
                " 1. Седнете или застанете во неутрална положба, а потоа свртете го лицето на едната страна за да погледнете преку рамото.\n" +
                " 2. Држете 5 секунди.\n" +
                " 3. Вратете ја главата во својата неутрална положба.\n" +
                " 4. Свртете ja повторно, овој пат на другата страна.\n", 1L, "https://www.verywellhealth.com/thmb/" +
                "taKjtLDviSbEU0yQnLvE2GGry2M=/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/Verywell-23-2696365-SideToSide" +
                "01-1908-59933a3fd088c00013cd036f.gif", "", "10 пати");

        this.exerciseService.create("Навалување на врат на страна", "Да се навалете странично кон вратот:\n \n" +
                " 1. Нежно свиткајте го вратот во обид да го допрете левото уво на рамото.\n" +
                " 2. Запрете кога се чувствува истегнување во десната страна на вратот.\n" +
                " 3. Држете ја положбата 20 секунди.\n" +
                " 4. Вратете се на почетната позиција.\n" +
                " 5. Повторете го над истегнување уште четири пати.\n" +
                " 6. Нежно свиткајте го вратот во обид да го допрете десното уво на рамото.\n" +
                " 7. Запрете кога се чувствува истегнување во левата страна на вратот.\n" +
                " 8. Држете ја положбата 20 секунди.\n" +
                " 9. Вратете се на почетната позиција.\n" +
                " 10. Повторете го ова истегнување уште четири пати.", 1L, "https://www.verywellhealth.com/thmb/" +
                "CUJp9SsZLCevtke-YR1m-ts0mjM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/" +
                "Verywell-23-2696365-EarToShoulder01-1912-59933a51d088c00013cd0562.gif", "", "10 пати");

        this.exerciseService.create("Подигање на карлица", "Наклонот на карлицата е вежба за секој што има болки во грбот, " +
                        "особено болка во долниот дел од грбот. Нè учи да ги користиме стомачните мускули на начин што го поддржува и издолжува " +
                        "долниот дел на грбот. За да ја направите вежбата:\n\n" +
                        " 1. Легнете на грб и свијте ги нозете во прав агол. \n" +
                        " 2. Подигнете ја карлицата колку што можете подалеку од подот и вдишете. \n" +
                        " 3. Држете 3-5 секунди.\n" +
                        " 4. Вратете ја карлицата во првобитната положба.", 2L,
                "https://www.verywellfit.com/thmb/bZu5_m_jqdBLpP02gh3UzixIBxg=/900x0/filters:no_upscale():max_bytes(150000):" +
                        "strip_icc():format(webp)/Verywell-01-2704746-Pelvic01-572-598b480703f4020010b122a6.gif",
                "", "5 пати");

        this.exerciseService.create("Лебедова поза", "Позата на лебедот ги зајакнува екстензорите на грбот." +
                        " Овие мускули се често слаби и претерано растегнати кај луѓе кои имаат болки во грбот.\n\n" +
                        " Изведете ја оваа вежба полека. За да ја направите" +
                        " вежбата:\n\n" +
                        " 1. Легнете со лицето надолу.\n" +
                        " 2. Држете ги рацете близу до телото додека со свиткани лакти и ги доведете рацете под рамената." +
                        " Рамената треба да бидат подалеку од ушите.\n" +
                        " 3. Исправете ги нозете. \n" +
                        " 4. Вдишете: Издолжете го 'рбетот, преку горниот дел од главата додека ги притискате подлактиците и " +
                        "рацете во подлогата за нагорен лак на горниот дел од телото. \n" +
                        " 5. Издишување: Вратете се во првобитна положба, издолжувајќи го 'рбетот додека торзото се враќа на подот.\n",
                2L, "https://www.verywellfit.com/thmb/acIEqUdf9GEPHvklQxadYit_bFw=/900x0/filters:no_upscale():max_bytes(150000)" +
                        ":strip_icc():format(webp)/Verywell-03-2704746-Swan01-597-598b483568e1a2001187323a.gif", "", "5 пати");

        this.exerciseService.create("Детска позиција", "За да ја направете оваа вежба следете ги следните чекори: \n" +
                        "1. Со рацете и колената на земја, спуштајте се надолу.\n" +
                        "2. Потпрете го стомакот на бутовите.\n" +
                        "3. Проширете ги рацете пред или заедно со телото со дланките свртени нагоре.\n" +
                        "4. Фокусирајте се на длабоко дишење и опуштање на сите области на напнатост или затегнатост.\n" +
                        "Држете ја оваа позиција до 1 минута.", 2L,
                "https://www.verywellfit.com/thmb/nP-iIWr5wNiyQIDJbWtf2se_d7Y=/900x0/filters:no_upscale():max_bytes(150000):" +
                        "strip_icc():format(webp)/Verywell-04-2704746-ChildsPose-598b48489abed50010aaeb62.gif",
                "", "5 пати");

        this.exerciseService.create("Абдоминално претискање", "Овие вежби се одлични за зајакнување на вашите основни " +
                        "мускули без да ставите премногу стрес на долниот дел на грбот и 'рбетот. Еве како правилно да вежбате:\n\n" +
                        " 1. Легнете на грб.\n" +
                        " 2. Свиткајте ги колената во удобна положба.\n" +
                        " 3. Ставете ги прстите зад главата или прекрстете ги рацете пред градите.\n" +
                        " 4. Свиткајте ја главата, рамената и горниот дел од грбот од подот\n" +
                        " 5. Држете го долниот дел на грбот во контакт со подот; треба да се кренете само неколку сантиметри.\n" +
                        " 6. Дишете додека станувате.\n" +
                        " 7. Држете ја оваа позиција три секунди.\n" +
                        " 8. Полека вратете се на почетната позиција.\n" +
                        "Ако чувствувате болка во грбот, консултирајте се со вашиот лекар или физикален терапевт.", 3L,
                "https://www.verywellhealth.com/thmb/b8cT6SqQhqMHikJ6DnJwpRzwb-4=/900x0/filters:no_upscale():max_bytes(150000):strip_" +
                        "icc():format(webp)/Verywell-1-2696610-AbdominalCrunch01-1853-5991f723af5d3a00114a1d7f.gif", "", "5 пати");

        this.exerciseService.create("Ниско подигање на ногата", "Ниското подигнување на ногата е предизвикувачки, " +
                        "но ефикасен начин за зајакнување на мускулите на долниот дел на стомакот. Еве како ќе го направите тоа:\n\n" +
                        " 1. Легнете на грб.\n" +
                        " 2. Свиткајте ги колената до одреден степен што ви е пријатно. Колку се исправени нозете, толку потешка ќе биде вежбата.\n" +
                        " 3. Подигнете ги стапалата околу 10 сантиметри нагоре.\n" +
                        " 4. Полека (во истото движење како лак) вратете ги нозете / стапалата на подот.", 3L,
                "https://www.verywellhealth.com/thmb/d9fYaxa-b1bx8hAVEOpOLfhdvvg=/900x0/filters:no_upscale():max_bytes(150000):strip_icc()" +
                        ":format(webp)/Verywell-2-2696610-LowAbLegRaise01-1859-5991f74668e1a20011fdc4a1.gif", "", "5 пати");

        this.exerciseService.create("Извртено седење", "Овие извртувачки стомачни се одличен начин да ги внесете вашите " +
                "странични мускули во акција и да работите правилно. Еве како ги правите:\n\n" +
                " 1. Легнете на грб.\n" +
                " 2. Свиткајте ги колената во удобна положба.\n" +
                " 3. Свиткајте ги прстите зад главата\n" +
                " 4. Навиткајте ја главата, рамената, горниот и долниот дел на грбот од подот и аголот на левиот лакт кон десното колено.\n" +
                " 5. Држете ја оваа позиција 5 секунди.\n" +
                " 6. Полека вратете се на почетната позиција.\n" +
                " 7. Навиткајте ја главата, рамената, горниот и долниот дел на грбот од подот и аголот на десниот лакт кон левото колено.\n" +
                " 8. Држете ја оваа позиција 5 секунди.\n" +
                " 9. Полека вратете се на почетната позиција.\n", 3L, "https://www.verywellhealth.com/thmb/HESqCxN6r37VSmp" +
                "OkAByJX1DjQQ=/900x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Verywell-3-2696610-TwistingSitups01-1890-" +
                "5991f7ba9abed50010ad9cc9.gif", "", "3-5 пати");

        this.exerciseService.create("Кружни движења со испружени раце", "За да ја направете овааа вежба," +
                        " 1. Раширете ги нозете во ширина на рамената.\n" +
                        " 2. Подигнете ги рацете настрана, поставете ги паралелно со земјата и стиснете ги тупаниците.\n" +
                        " 3. Започнете брзо да ги ротирате рацете во насока на стрелките на часовникот.\n" +
                        " 4. Направете 20 круга, па спуштете ги рацете и одморете се 15 секунди.\n" +
                        " 5. Повторете во обратна насока", 4L, "https://wl-sympa.cf.tsp.li/dbb/043/3c8a865085a07dd35db45dbb60.gif",
                "", "1-3 пати");

        this.exerciseService.create("Вкрстување - ножички", "За да ја направете оваа вежба," +
                        " 1. Застанете исправени со раздвоени нозе.\n" +
                        " 2. Подигнете ги рацете на страните, а потоа прекрстете ги пред вас како да ја формирате буквата \"X\".\n" +
                        " 3. Вратете се во почетната позиција.\n" +
                        " 4. Повторете го ова движење 20 пати.\n" +
                        " 5. Спуштете ги рацете 10 до 15 секунди.", 4L,
                "https://wl-sympa.cf.tsp.li/099/642/d323fa542bbff71b6714cbdbc7.gif", "", "1-3 пати");

        this.exerciseService.create("Затворање - клештички", "За да ја направете оваа вежба," +
                        " 1. Ставете ги стапалата раширени во ширина на рамото.\n" +
                        " 2. Кренете ги рацете настрана, ставајќи ги паралелно со подот и стиснете ги дланките во тупаници ако можете.\n" +
                        " 3. Потоа свиткајте ги рацете, така што тупаниците ќе бидат на исто ниво со пазувите.\n" +
                        " 4. Вратете се во почетната позиција.\n" +
                        " 5. Повторете го ова движење 20 пати.\n" +
                        " 6. Спуштете ги рацете 15 секунди.", 4L,
                "https://wl-incrivel.cf.tsp.li/b4a/006/795d7b529f82a5d972ebafcc43.gif", "", "1-3 пати");

        this.exerciseService.create("'Рбетно свртување", "За да ја направете оваа вежба:" +
                " 1. Седнете странично на стол, свртени кон лево. " +
                " 2. Завртете го торзото кон лево, држејќи се на задниот дел од столот, за спинален пресврт.\n" +
                " 3. Исправете го 'рбетот на секое вдишување и извртувајте го на секое издишување за пет вдишувања.\n" +
                " 4. Поместете ги нозете на десната страна од столот и повторете го пресвртот на десната страна. " +
                " Вежбата може да се прави во седечка или стоечка позиција. ", 5L, "https://www.verywellfit.com/thmb/" +
                "qCyEwH_HJanmWTjj-tJcfAFp-3E=/900x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Verywell-07-3567189-" +
                "SpinalTwist02-1182-5980de510d327a0011b4cec9.gif", "", "5 пати");

        this.exerciseService.create("Рамнотежа - вага", "За да ја направете оваа вежба: " +
                " 1. На издишување, отворете ги рацете со десната рака да излезе напред и левата да се врати назад.\n" +
                " 2. Наместете го левиот колк назад и свртете го торзото налево, така што ќе се порамни со предниот дел од столот.\n" +
                " 3. Погледнете преку десните врвови на прстите и држете го рамнотежа три вдишувања. " +
                " Вежбата може да се прави во седечка или стоечка позиција. ", 5L, "https://www.verywellfit.com/thmb/" +
                "Jd64m22hwTa8S7w-YI_exDkCsE8=/900x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Verywell-09-3567189-" +
                "ChairWarriorTwo-1188-5980de7cd088c0001107bd17.gif", "", "5 пати");

        this.exerciseService.create("Остро подигање на раце", "За да ја направете оваа вежба: " +
                " 1. На вдишување, кренете ги рацете кон таванот.\n" +
                " 2. Одржувајте добро држење на горниот дел од телото со раменици опуштени и исправен 'рбет природно седејќи. " +
                " 3. Зацврстете ги коските за седење на седиштето на столот и достигнете нагоре од таму. " +
                " Вежбата може да се прави во седечка или стоечка позиција. ", 5L, "https://www.verywellfit.com/thmb/" +
                "B6hC-fL8Z0LO4PqEEQlXqhdVh08=/900x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Verywell-02-3567189-" +
                "ChairRaisedHands01-1143-5980dccc03f4020010eee3db.gif", "", "5 пати");

        this.exerciseService.create("Истегнување на дланка", "Чекори: " +
                        " 1. Едната рака ставете ја исправена пред вас, лактот исправен, со рачниот зглоб и прстите свртени кон подот.\n" +
                        " 2. Раширете ги прстите малку и со другата рака ставете нежен притисок на раката свртена надолу, " +
                        "истегнувајќи ги зглобот и прстите колку што можете.\n" +
                        " 3. Кога ќе ја достигнете максималната точка на флексибилност, држете ја оваа позиција околу 20 секунди.\n" +
                        " 4. Префрлете се на другата рака и повторете. ", 6L, "https://images-prod.healthline.com/hlcmsresource/" +
                        "images/topic_centers/Fitness-Exercise/648x364_3_Wrist_Exercises_to_Prevent_Carpal_Tunnel_EXERCISE_3.gif", "",
                " 3 пати на секоја рака, минимум 3 пати дневно");

        this.exerciseService.create("Истресување", "Ова е едноставно како што звучи: истресете ги дланките" +
                " како да сте ги измиле и се обидувате да ги исушите на воздух.\n" +
                " Направете го ова на една минута или две на секој час за да не се стегнат мускулите на вашите раце " +
                "и неговиот медијален нерв во текот на денот. ", 6L, "https://www.isgnedir.com/wp-content/uploads/2018/" +
                "07/karpal-tunel-egzersiz-2.gif", "", "Една до две минути, минимум 3 пати дневно");

        this.exerciseService.create("Пајакови склекови", "Чекори: " +
                " 1. Започнете со дланките поставени заедно, споени во внатрешната страна.\n" +
                " 2. Раширете ги прстите одделно колку што можете, а потоа „закочете“ ги прстите со одделување " +
                "на дланките, но држејќи ги прстите заедно. " +
                " 3. Држете ги дланките во оваа положба 30 секунид", 6L, "https://www.isgnedir.com/wp-content/uploads/2018/07/" +
                "karpal-tunel-egzersiz.gif", "", "Минимум 3 пати дневно");

        this.exerciseService.create("Ниско подигање на нога", "Кратката вежба со ниско подигање е одличен начин" +
                " вистински да се фокусирате на правилно вежбање на вашите мускули на квадрицепс. Еве како го правите тоа:\n" +
                " 1. Легнете на грб и користете помагало (во случајов тоалет) за да го поткренете коленото нагоре.\n" +
                " 2. Полека исправете го свитканото колено додека не биде исправено.\n" +
                " 3. Затегнете го вашиот квадрицепс со прстите насочени кон таванот и држете го цврсто пет секунди.\n" +
                " 4. Полека спуштете ја ногата надолу." +
                " Повторете го истото и со другата нога", 7L, "https://www.verywellhealth.com/thmb/YR1bE1F-" +
                "DpSnkn1M1w0mwwIyxsw=/900x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Verywell-02-2696617-" +
                "ShortArcQuads01-SM-5979fb1303f4020010f431d2.gif", "", "5-10 пати");

        this.exerciseService.create("Странично движење со ластик", "Вежбата за страничнo движење со ластик ги зајакнува" +
                        " мускулите на страната на колковите познати како глутеус медиус. Овие мускули се важни за одржување на стабилноста при" +
                        " одење и трчање. Tреба да набавите лента со латекс или ластик за да ја изведете оваа вежба.\n" +
                        "Врзете ја лентата за терапија во јамка. Ставете ги двете нозе во внатрешноста на јамката и застанете. " +
                        "Отворете ги широко нозете за да ја натегнете лентата. Правете мали чекори настрана. ", 7L,
                "https://www.verywellhealth.com/thmb/ygf5Q30XtY8Ej6ts4Z4kmrYE4s0=/900x0/filters:no_upscale():max_bytes(150000)" +
                        ":strip_icc():format(webp)/Verywell-25-2696611-LateralBandWalk01-1843-5993448d0d327a001068c4af.gif",
                "", "5-10 пати");

        this.exerciseService.create("Високо подигање на нога", "Оваа вежба е слична како првата но се изведува " +
                "без помагало. Легнете на грб, свиткајте го едното колено, затегнете го квадрицепсот и подигнете ја ногата нагоре" +
                " колку можете повисоко. Истото повторете го и со другата нога. ", 7L, "https://www.verywellhealth." +
                "com/thmb/qRL3ay8We_PnGNqGsMzzK-liH9s=/900x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/" +
                "Verywell-27-2696517-StraightLegRaise01-1954-59934a65c412440011d1e10a.gif", "", "5-10 пати");

        this.exerciseService.create("Дорзифлексија", "Дорзифлексија на глуждот е движење на свиткување на глуждот " +
                        "нагоре кон коската. Добивањето на ова движење може да ви помогне да одите нормално. " +
                        "Еве како да добиете повеќе дорзилексија на глуждот:\n" +
                        " 1. Движејќи го само глуждот, насочете го стапалото назад кон вашиот нос (додека ги држите колената исправени). " +
                        "Продолжете сè додека не почувствувате непријатност или не можете повеќе да го навалите назад.\n" +
                        " 2. Држете ја оваа позиција 15 секунди.\n" +
                        " 3. Вратете се во неутрална положба и повторете со другото стапало. ", 8L,
                "https://www.verywellhealth.com/thmb/g45xn0zuXY4_CcNYcMbUev_olC8=/900x0/filters:no_upscale():max_bytes(150000)" +
                        ":strip_icc():format(webp)/Verywell-01-2696480-Dorisflexion-598ca2a40d327a0010eb724e.gif", "", "10 пати");

        this.exerciseService.create("Внатрешно / надворешно вртење", "Оваа вежба се изведува со движење на глуждот кон " +
                "надворешниот/страничниот или внатрешниот дел на ногата. Изведете ја оваа вежба за да добиете движење на еверзија во глуждот:\n" +
                " 1. Движејќи го само глуждот и држејќи ги прстите насочени, свртете ја ногата нанадвор, подалеку од другата нога. " +
                "Продолжете сè додека не се почувствува непријатност или повеќе не можете да ја свртите ногата нанадвор.\n" +
                " 2. Држете ја оваа позиција 15 секунди.\n" +
                " 3. Вратете се во неутрална позиција. " +
                " 4. Движејќи го глуждот, свртејте ја ногата навнатре, поблиску кон другата нога колку можете повеќе." +
                " Повторете со другата нога", 8L, "https://www.verywellhealth.com/thmb/4PxCcCau2kd2nD0WeJhMAuDcDws=/" +
                "900x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Verywell-02-2696480-Eversion-598ca56b9abed50010498" +
                "fad.gif", "", "10 пати");
        
        this.exerciseService.create("Плантарна флексија", "Плантарна флексија е движење на насочување на глуждот" +
                " надолу и подалеку од вас. Еве како да добиете опсег на движење на плантарна флексија на глуждот (ROM):\n" +
                " 1. Движејќи го само глуждот, насочете го стапалото напред (додека ги држите колената исправени). " +
                "Продолжете сè додека не почувствувате непријатност или не можете да го поместите понатаму.\n" +
                " 2. Држете ја оваа позиција 15 секунди.\n" +
                " 3. Вратете се во неутрална позиција и повторете со другото стапало. ", 8L, "https://www." +
                "verywellhealth.com/thmb/XiWorgtvFQQClrvnbG2QW_NuEV4=/900x0/filters:no_upscale():max_bytes(150000):strip_icc():format" +
                "(webp)/Verywell-02-2696480-PlantarFlexion-598ca2f822fa3a0010e6452d.gif", "", "10 пати");


        this.exerciseService.create("Исправен Лебед", "За да ја направете оваа вежба следете ги следните чекори: \n" +
                        "1. Легнете на стомак и ставете ги рацете рамно под рамената.\n" +
                        "2. Свиткајте ги лактите за вашите страни и нежно подигнете ја главата и градите, држејќи ги колковите " +
                        "и препоните на креветот.\n" +
                        "3. Не заборавајте да ги опуштите вратот и рамената. Држете го истегнувањето 15-20 секунди " +
                        "и кога сте подготвени, нежно спуштете се надолу.\n Оваа вежба е за истегнување на грбот."
                , 9L,
                "https://www.verywellfit.com/thmb/aNkiqfbVAUzQax2jl-99y0vqJqo=/900x0/filters:no_upscale():max_bytes" +
                        "(150000):strip_icc():format(webp)/Verywell-03-2704746-Swan01-597-598b483568e1a2001187323a-59a57a48d088c000114e18b3.gif",
                "", "2 пати");

        this.exerciseService.create("Странично истегнување", "За да ја направете оваа вежба следете ги следните чекори: \n" +
                        "1. Лежејќи на грб, подигнете го едното колено и нежно превртете го на спротивната страна. Осигурете се дека " +
                        "и двете рамена остануваат во контакт со подлогата постојано..\n" +
                        "2. Треба да го почувствувате истегнувањето на страните на горниот дел од телото и долниот дел на грбот.\n" +
                        "3. Дишете длабоко и повторете го на спротивната страна.\n"
                , 9L,
                "https://www.verywellfit.com/thmb/3TEbXpzrpMJwy0A4RlhA3zQCQ04=/1500x844/smart/filters:no_upscale()/" +
                        "Verywell-20-4023748-SpinalTwist01-1729-5995b536845b340010c016cf.gif",
                "https://www.verywellfit.com/thmb/3TEbXpzrpMJwy0A4RlhA3zQCQ04=/1500x844/smart/filters:no_upscale()" +
                        "/Verywell-20-4023748-SpinalTwist01-1729-5995b536845b340010c016cf.gif", "по 30 секунди на секоја страна");

        this.exerciseService.create("Исчекор со истегнување", "За да ја направете оваа вежба следете ги следните чекори: " +
                " 1. Започнете во положба на движење напред и испуштете го левото колено.\n" +
                " 2. Ставете го десниот лакт на внатрешноста на десното колено како на сликата.\n" +
                " 3. Допрете го десниот лакт во десното колено и извртете го торзото налево.\n" +
                " 4. Достигнете ја левата рака зад вас додека не почувствувате нежно истегнување во долниот дел на грбот " +
                "и десната препона.\n" +
                " 5. Држете околу 20 до 30 секунди, ослободете се и повторете го на другата нога.\n" +
                "Можете да го измените овој потег врз основа на вашата анатомија, флексибилност и ограничувања. Вежбата е за истегнување" +
                " на колкови, препони и долниот дел од грбот", 9L, "https://www.verywellfit.com/thmb/4qi1_" +
                "y80W7sr1fUkj1SpJEr5L78=/900x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Verywell-04-3120314-" +
                "HipOpener01-209-599d8a2f519de2001121bf9a.gif", "", "2-3 пати");

        this.exerciseService.create("Енергично дишење", "Оваа техника е за регулирање на протокот на енергија низ телото. " +
                "Помага и при истегнување на вратот, област која честопати ја задржува напнатоста и се закопчува од гледање на екраните" +
                " цел ден.\n" +
                "1. Ставете ги рацете на колена со дланките свртени нагоре. Вдишете така што вашите бели дробови се полни околу две третини," +
                " а потоа задржете го здивот.\n" +
                "2. Спуштете ја брадата надолу и повлечете ја поблиску до градите правејќи двојна брада. Во исто време, подигнете ја " +
                "градната коска кон брадата. Опуштете ги рамената подалеку од ушите и уживајте во тишината.\n" +
                "3. Држете онолку колку што е пријатно, а потоа подигнете ја брадата нагоре и завршете го вдишувањето пред да го " +
                "ослободите здивот. ",10L, "https://www.becarehealth.com/wp-content/uploads/2019/04/yoga-burn-" +
                "meditation-solution.gif", "", "10 пати");

        this.exerciseService.create("Латерално дишење", "Во оваа техника, го носете здивот нагоре од долниот" +
                " дел на стомакот и се фокусирате на пренасочување на здивот во задниот дел од телото и страните на градниот кош. " +
                "Користете ја оваа вежба за да се обучите за латерално дишење." +
                "1. Седнете удобно.\n" +
                "2. Ставете ги рацете на страните на телото околу половината.\n" +
                "3. Длабоко вдишете низ носот и исправете се. " +
                "4. Запомнете дека вашите бели дробови седат во внатрешноста на трупот и ребрата можат да се шират со секој здив. " +
                "5. Издишете преку устата. Ребрата ќе се контрахираат и рацете ќе се повлечат едни кон други.", 10L, "https://www.verywellfit.com/thmb/mczi5sUulFmEN_uCx5xRkze3fSM=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/16-2704659-Lateral-BreathingGIF-e8ca1766f0d840b4a4d836b74a67a518.gif", "", "10 пати");

        this.exerciseService.create("Медитеранско дишење", "Оваа техника покрај тоа што ви го регулира дишењето, " +
                "исто така ги вклучува вашите раце. Седнете или застанете во позиција за одмарање, допрете ги внатрешните делови од " +
                "вашите дланки една со друга и вдишете и издишете подолго време задржувајќи го здивот 5-10 секунди." +
                " Регулирањето на дишењето помага многу при изведувањето на вежбите. ", 10L,
                "https://www.verywellfit.com/thmb/hpjA45LZ3k83Xna3ThBDJHwhtMU=/768x0/filters:no_upscale():" +
                        "max_bytes(150000):strip_icc():format(webp)/26-3566797-Throat-Lock-GIF-a96684d1ab734aff9d19e6430f808f72.gif",
                "", "10 пати");
        // za uslovi delot bolesti nekoj
        ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        //.......................
        //.......................
        //.......................
        this.diseaseService.create("Астма","Астмата е долгорочна белодробна состојба што може да се контролира, но не може да се излечи. Децата со астма имаат чувствителни дишни патишта во белите дробови кои реагираат на предизвикувачи, познат и како напад на астма. Симптомите варираат од дете до дете, но обично вклучуваат загушување, затегнато чувство во градите, отежнато дишење или кашлање. Овие симптоми обично се јавуваат ноќе, рано наутро или за време / непосредно по физички напор.\n" +
                        "ЗОШТО Е ВАЖНО ДА СЕ ВЕЖБА!\n" +
                        "Важно е децата со астма да продолжат да учествуваат во физичка активност, бидејќи може да ги намали симптомите со зајакнување на нивното срце и бели дробови.\n" +
                        "Ова може да го подобри нивното дишење и да ги намали нападите на астма - подобрување на нивниот квалитет на живот. Важно е да се разбере моделот на астма на вашето дете за ефикасно управување со симптомите. Важно е децата, родителите, наставниците и тренерите да бидат едуцирани за планот за управување со астма на вашето дете. Секое дете е различно и ќе има различни искуства со својата астма, затоа познавањето на фактите за физичката активност е клучно.\n" +
                        "Работи што треба да се запомнат:\n" +
                        "Идентификација на предизвикувачи (како треви, полен и загадување). Со минимизирање на изложеноста на предизвикувачи и имаат соодветен план за управување со астма, децата со астма се во можност да учествуваат во физичка активност со намален ризик од напад.\n" +
                        "Пред да започнете со активност, вашето дете треба да зема лекови за олеснување до 15 минути пред загревање или според упатствата на нивниот лекар.\n" +
                        "Секогаш бидете сигурни дека вашето дете се загрева пред вежбање и се лади по вежбање.\n" +
                        "Вид на вежба и количина на време за вежбање на кое го изложувате вашето дете е важен. Енергична активност шест минути или повеќе на ладен, сув воздух е поверојатно да предизвика астма. Осигурете се дека вашето дете ги следело упатствата за земање лекови против олеснување доколку учествувате во активност рано наутро или ако тренирате / играте ноќе во зимските месеци.\n" +
                        "ВИДОВИ ВЕERБА ПРЕПОРАЧАНИ:\n" +
                        "\n" +
                        "Многу одлични и препорачани вежби за деца со астма се јога, пешачење, велосипедизам, пешачење, гимнастика и пливање.\n" +
                        "Кога започнувате нова активност, осигурете се дека вашето дете започнува на ниско ниво и постепено го зголемува нивното ниво на движење бидејќи се чувствува пријатно. Вршење на нови активности кои се премногу енергични за нивото на подготвеност на вашето дете, може да предизвикаат активирање на симптоми на астма. Знајте дека со текот на времето, како што вашето дете станува подобар, така и неговите бели дробови и напади на астма ќе станат помалку веројатно. Секогаш имајте на располагање лекови за ослободување во секое време кога вашето дете вежба.",
                         "https://exerciseright.com.au/wp-content/uploads/2016/12/Chronic-conditions-banner-asthma-1.jpg");
        this.diseaseService.create("Аутизам","Децата со аутизам обично се помалку способни да комуницираат со светот како што прават другите деца. Тие обично имаат дефицит во вербална и невербална комуникација, социјална свест и интеракции и имагинативна игра (варијабилни интереси и однесување). Бидејќи на децата со аутизам често им е тешко да комуницираат и / или да комуницираат во социјални контексти и често доживуваат повторувачки обрасци на однесување и интереси, тоа понекогаш може да го отежне инволвирањето во здрав начин на живот.\n" +
                "Вежбањето може да помогне во управувањето со негативните здравствени импликации на физичката неактивност врз целокупното здравје, а исто така може да помогне во управувањето со бројни симптоми специфични за Аутизмот. Истражувањата ги поддржуваат придобивките поврзани со моторниот развој и физичката подготвеност, како и намалувањето на повторувачкото, стереотипното и самоповредливото однесување и подобрувањата поврзани со когницијата. Вежбањето е пријавено дека придонесува или ги подобрува резултатите од третманот, помага во управувањето со однесувањето, ги подобрува академските перформанси, како и обезбедува холистички придобивки за здравјето и ги минимизира здравствените ризици поврзани со неактивноста.\n" +
                "ЗОШТО Е ВАЖНО ДА СЕ ВЕЖБА!\n" +
                "Истражувањата покажуваат дека интервенциите во вежбите доведоа до 37% подобрување на симптомите на АСН, поточно однесувањето и академското подобрување. Една студија објавена во 2018 година, со оглед на ефектот на вежбање врз деца со аутизам, откри дека оние кои биле изложени на интервенција за вежбање двапати неделно, во текот на 48 недели, покажале важно намалување на симптомите поврзани со аутизмот.\n" +
                "Придобивките беа особено изразени во намалувањето на стереотипните модели на однесување и подобрувањата во вербалните и невербалните вештини за социјална комуникација. Истата студија исто така објави дека родителското согледување за квалитетот на животот на нивното дете значително се зголемило во споредба со контролната група. Интервенциите за вежбање можат да варираат во зависност од тежината на Аутизмот.\n" +
                "Подобрувања во однесувањето\n" +
                "Умерено до енергично вежбање може да покаже ефект врз намалувањето на повторувачкото однесување кај децата и адолесцентите со АСН. Вежбањето е пожелен третман за да се намали само-стимулаторното однесување (ССБ) бидејќи е ефтин и може да биде лесна форма на лекување, а дополнителните здравствени придобивки од вежбањето можат да помогнат во подобрување на квалитетот на животот на децата и адолесцентите со АСН. Акредитиран физиолог за вежбање може да помогне во работата со детето и семејството за да се најде најдобрата вежба и да постави план за вежбање што може лесно да се заврши на дневна основа.\n" +
                "Вежбањето може да се опише како претходен пристап, кој може да помогне во спречување на штетно однесување, со што се намалува мотивацијата за извршување на однесувањето. Ова може да има корисни ефекти надвор од сесијата за вежбање и може да помогне да се подобрат позитивните однесувања и да се спречи појавата на проблематично однесување.\n" +
                "Подобрувања во физичкото здравје и благосостојбата\n" +
                "Придобивките од вклучување на лица со АСН во индивидуално прилагодена програма за вежби вклучуваат подобрувања во резултатите за аеробна кондиција и мускулна сила, координација и моторно планирање, рамнотежа и позитивно учество во физичка активност. Бруто и фината моторика може да се подобрат и со вежбање. Ова е важно, бидејќи слабите моторни вештини, вклучително и тешкотиите со моторната координација и рамнотежата кај младите со АСН, може да ги ограничат нивните активности на избор и може да доведат до помалку активен животен стил.\n" +
                "ВИДОВИ ВЕЖБИ ПРЕПОРАЧАНИ:\n" +
                "Кардиоваскуларни вежби и обука за сила / отпор (под надзор) секој ден, вкупно 60 минути (запомнете дека ова може да се прекине преку ден).\n" +
                "Започнете со 5-10 минути континуирана активност, 1-2 дена во неделата. Полека зголемете го времетраењето на активноста на 10-30 минути, 3-4 дена во неделата. Подоцна можете да го зголемите на 15-60 минути за 5-7 дена во неделата.\n" +
                "Пливањето и водената игра добро функционираат кај деца со големи сетилни потреби.\n" +
                "Фокусирајте се на поттикнување на основните вештини за движење - трчање, фаќање, клоци, скокање, фрлање, клоци или скокање. Додека ова за некои изгледа како големи чекори, разделете ја секоја вештина на мали делови и фокусирајте се на претерани движења.",
                "https://exerciseright.com.au/wp-content/uploads/2019/02/ER-for-kids-condition-name-banner3.jpg");
        this.diseaseService.create("Епилепсија","Епилепсијата е нарушување на функцијата на мозокот што има форма на повторливи напади. Типично, епилепсијата се дијагностицира кај деца под 5 години, меѓутоа епилепсијата може да се појави во која било фаза низ целиот животен век.\n" +
                        "Нападите поврзани со епилепсија често се јавуваат кога ненадејни, неконтролирани рафали на електрична активност ги нарушуваат редовните модели на активност на мозокот. Сепак, нападите можат да влијаат на поединци на различни начини и зависат од тоа каде се случува нападот во мозокот. Нападите често влијаат на движењето, мислите, сензациите, однесувањето и нивото на свест.\n" +
                        "Ако имате било какви проблеми во врска со вашето дете и вежбање, контактирајте со акредитиран физиолог за вежбање кој може да развие соодветна програма за вежбање.\n" +
                        "ЗОШТО Е ВАЖНО ДА СЕ ВЕЖБА:\n" +
                        "Во многу случаи на напади на епилепсија се случуваат одеднаш и често без предупредување. Клучната порака за децата со епилепсија е да обезбедат учество во физичка активност, вежбање или спортување во безбедна средина. При вежбање, децата со епилепсија треба да останат хидрирани и да избегнуваат преголем напор и низок шеќер во крвта (хипогликемија).\n" +
                        "Вежбите во врска со епилепсијата во некои случаи покажаа дека ги намалуваат абнормалните читања на ЕЕГ, ја намалуваат фреквенцијата на напади и го намалуваат бројот на други истовремени заболувања или здравствени поплаки, како што се болки во мускулите, проблеми со спиењето, депресија и замор.\n" +
                        "Вежбањето исто така покажа дека ја подобрува самодовербата и социјалната интеграција, елементи на благосостојба на индивидуата, кои често можат да бидат засегнати од епилепсија\n" +
                        "Работи што треба да се запомнат:\n" +
                        "Пред да се вклучите во програма за вежбање, консултирајте се со специјалист за лекување на вашето дете, матичен лекар и акредитиран физиолог за вежбање\n" +
                        "Избегнувајте познати предизвикувачи на напади на вашето дете\n" +
                        "Осигурете се да се земаат соодветни лекови\n" +
                        "Осигурете се дека вашето дете останува добро хидрирано и има пијалок или ужинка за да избегнете хипогликемија\n" +
                        "Ако вашето дете се чувствува слабо, светлоглаво, гадно или дехидрирано, избегнувајте вежбање\n" +
                        "Доколку се занимавате со спортови на вода, осигурете се дека вашето дете носи спасувачка јакна\n" +
                        "ВИДОВИ ВЕЖБИ ПРЕПОРАЧАНИ:\n" +
                        "Кога вашето дете работи со акредитиран стручњак за вежбање, тие ќе обезбедат различни безбедни и различни техники за вежбање за да му помогнете на вашето дете да се вклучи во редовно физичко вежбање за да ја подобри нивната физичка подготвеност, самодоверба и социјална интеграција.",
                "https://exerciseright.com.au/wp-content/uploads/2017/03/Chronic-conditions-banner-epilepsy.jpg");
        this.diseaseService.create("Дијабетис"," Кога вашето дете работи со акредитиран стручњак за вежбање, Дијабетес\n" +
                        "Дијабетесот е сложена состојба што може да влијае на целото тело. Дијабетесот бара секојдневна грижа за себе и доколку се развијат компликации, дијабетисот може да има значително влијание врз квалитетот на животот и може да го намали очекуваниот животен век.\n" +
                        "Постојат различни видови на дијабетес; сите видови се сложени и сериозни. Трите главни типа на дијабетес се тип 1, тип 2 и гестациски дијабетес (се јавуваат во бременост).\n" +
                        "Над 6.000 деца на возраст од 0-14 имале дијабетес тип 1 во 2013 година.\n" +
                        "За целосни информации за дијабетес тип 1 и 2, контактирајте дијабетес Австралија.\n" +
                        "ЗОШТО Е ВАЖНО ДА СЕ ВЕЖБА\n" +
                        "Вежбите за деца со дијабетес тип 1 и 2 имаат многу различни придобивки, од подобрување на контролата на телесната тежина и намалување на ризикот од кардиоваскуларни болести до зголемување на самодовербата и општо добро.\n" +
                        "Знајте дека е безбедно и многу се препорачува за деца со дијабетес да вежбаат. Редовната физичка активност и вежбање се од клучно значење за да се помогне во стабилизирање на нивото на шеќер во крвта на вашето дете, да се намали дебелината поврзана со лошата исхрана и недостаток на активност и да се намалат компликациите, како што се проблеми со очите, нервите, бубрезите и срцето со стареењето на вашето дете.\n" +
                        "Работи што треба да се запомнат:\n" +
                        "Дијабетесот не треба да ја ограничува способноста на секое дете во избран спорт. Активноста треба да се охрабрува.\n" +
                        "Прилагодени оброци и инјекции на инсулин соодветно на видот и времетраењето на вежбите што ги презема вашето дете.\n" +
                        "Следењето на гликозата во крвта е клучно. Мерењата треба да се направат пред, за време и по вежбање.\n" +
                        "Следењето на гликозата во крвта неколку часа по вежбање и пред спиење е особено критично за да се осигура дека вашето дете нема хипогликемична состојба преку ноќ.\n" +
                        "ВИДОВИ ВЕЖБИ ПРЕПОРАЧАНИ:\n" +
                        "Општата физичка активност треба да се охрабрува најмалку 40 -60 минути на ден.\n" +
                        "Треба да се охрабрат вежби за носење тежина под водство на професионалец, како што е акредитиран за вежбање, за да помогне во подобрувањето на целокупната јачина на детето и контролата и регулацијата на гликозата.\n" +
                        "Флексибилноста е исто така важна, затоа обидете се и охрабрувајте лесно истегнување пред и по вежбање.ие ќе обезбедат различни безбедни и различни техники за вежбање за да му помогнете на вашето дете во редовно физичко вежбање за да ја подобри нивната физичка подготвеност, самодоверба и социјална интеграција.",
                        "https://exerciseright.com.au/wp-content/uploads/2017/01/Chronic-conditions-banner-Diabetes.jpg");
        this.diseaseService.create("Физички онеспособености","Секое дете, без оглед на попреченост или способност, треба да се занимава со физичка активност. Со вклучување во физичка активност, децата можат да го зголемат развојот на скелетот, да го зголемат здравјето на срцето и белите дробови, да ги подобрат функционалните движења и да бидат повеќе социјални со врсниците. Вежбањето треба да биде забавно и привлечно, без разлика дали е изменето или не, и да обезбеди излез за децата со попреченост да го откријат нивниот вистински потенцијал. Да се има попреченост не треба да биде причина децата да не се занимаваат со физичка активност.\n" +
                        "Ако имате било какви проблеми во врска со вашето дете и вежбајте, контактирајте со акредитиран за вежбање кој може да ве води во развој на соодветна програма за вежбање.\n" +
                        "ЗОШТО Е ВАЖНО ДА СЕ ВЕЖБА?\n" +
                        "Внимателно надгледувано вежбање може да му помогне на секое дете со попреченост на повеќе начини, вклучувајќи подобрување на кардиоваскуларното здравје, посилни мускули и коски, да го намали ризикот од хронични состојби како што се артритис, остеопороза и дијабетес тип 2. Физичката активност исто така му помага на вашето дете да стекне независност и да изгради самодоверба.\n" +
                        "Децата треба да ја прифатат својата попреченост и да учествуваат во што повеќе физички активности. Обезбедувањето соодветни модели на улоги во полето на попреченост (како што се параолимпијците) помага во градењето на самодоверба и уверување. Сите деца треба да имаат аспирација да бидат одлични во нешто.\n" +
                        "Работи што треба да се запомнат:\n" +
                        "Постојат можности да учествувате и во целосно способни и во модифицирани физички активности. Осигурете се дека вашето дете има можност да се занимава со спорт / активности соодветни на способноста на вашето дете.\n" +
                        "Образованието и мотивацијата околу способноста на детето е од суштинско значење за промовирање на самодовербата во социјалните контексти.\n" +
                        "Побарајте совет од акредитиран за вежбање ако имате некакви проблеми.\n" +
                        "ВИДОВИ ВЕЖБИ ПРЕПОРАЧАНИ:\n" +
                        "Некои одлични вежби за деца со телесен инвалидитет се бокс и пливање и воден аеробик. Боксот и пливањето промовираат зголемена функција и сила на надлактицата, како и кардиоваскуларна издржливост.\n" +
                        "Забавните активности вклучуваат програми како што е Wii. Wii нуди активности користејќи ги само вашите раце за да можат да учествуваат оние што се на инвалидска количка. Игрите вклучуваат бокс, тенис, бејзбол и куглање. Ова е одличен начин да го вклучите целото семејство и да го задржите вашето дете во движење.\n" +
                        "Важно е да се напомене дека децата со телесен инвалидитет можат да учествуваат во повеќето спортови. Спортот може да биде забавен за играње и може да му даде емоционален поттик на вашето дете. За да пронајдете спортови со кои може да се занимава вашето дете, прашајте ги другите родители, наставници, лекари и терапевти бидејќи тие честопати се свесни за достапните програми за помош на вашето дете. Откако ќе пронајдете програма, секогаш треба вашето дете да ја испроба. Не сите програми ќе работат за секого. Пронајдете таков што вашето дете се чувствува пријатно да се придружи и ужива да го направи.",
                "https://exerciseright.com.au/wp-content/uploads/2017/01/Chronic-conditions-banner-Physical-Disabilities.jpg");

        this.diseaseService.create("Мускулна дистрофија","\n" +
                "ЗОШТО Е ВАНО ДА СЕ ВЕЖБА\n" +
                "Вежба за управување со невромускулни услови е да се зачуваат функционалните способности на поединецот што е можно подолго. Одложувањето на загубата на функционални способности кај оние со невромускулна состојба може да го продолжи степенот на независност и да помогне во можноста за преземање активности од секојдневно живеење, а со тоа и подобрување на менталната благосостојба.\n" +
                "Други придобивки од вежбање:\n" +
                "Развијте рамнотежа и координација\n" +
                "Зголемете ја фитнесот, подвижноста, флексибилноста и независноста\n" +
                "Намалете го ризикот од болест поврзана со неактивност како што се дебелина, дијабетес и висок крвен притисок\n" +
                "Подобрување на менталното здравје, самодовербата и механизмите за справување\n" +
                "Помогне да се намали нивото на болка\n" +
                "Подобрете ги навиките за спиење\n" +
                "Создадете чувство на нормалност\n" +
                "Работи што треба да се сеќаваат\n" +
                "Како што се развива состојбата, потребна е поголема количина на енергија за активности и движење, и честопати резултира со зголемено седечко време и неактивност. Неактивноста потенцијално може да доведе до секундарна дегенерација на здрави мускулни влакна преку прогресивно искористување на мускулите - истиот ефект неактивноста го има врз нечии мускули. Овој несакан ефект на неактивност е посиромашен за некој што веќе доживува прогресивна мускулна слабост и дегенерација. Прилагодената физичка активност од страна на акредитиран физиолог за вежбање (АЕП) може да помогне во одложување на секундарното влошување на мускулното ткиво и губење на функционалните способности како резултат на неискористување.\n" +
                "Акредитиран за вежбање може да обезбеди добро дизајнирана програма за да осигури дека детето завршува редовна активност прилагодена. Со оглед на тоа што АЕП ќе го земе предвид созревањето на индивидуата, како и сериозноста, стапката на прогресија и локацијата на мускулната слабост и внимателниот избор на видот на вежбата, фреквенцијата, интензитетот и времетраењето на тренингот, вежбањето може да биде корисно . Редовната активност може да ја одложи дегенерацијата и да ја подобри / одржи силата и да го подобри квалитетот на животот на детето.\n" +
                "Важно е да се напомене дека и покрај неговите придобивки, вежбањето не е лек и не може да спречи прогресивна дегенерација на мускулните влакна.\n" +
                "ВИДОВИ ВЕЖБИ ПРЕПОРАЧАНИ:\n" +
                "Флексибилност: им помага на зглобовите да се движат, а подобрувањето на флексибилноста може да помогне во подобрувањето на начинот на движење на телото, да спречи контрактура и да помогне во минимизирање на повредите. Редовно истегнување е важно, особено за вкочанети мускули. Вежби како јога можат да бидат корисни, како и редовна програма за истегнување што е можно повеќе денови.\n" +
                "Јачина на мускулите: посилните мускули помагаат при движење, држење на телото, удобност и независност. Активностите за зајакнување на мускулите треба да се прават 3 пати неделно. Вежбите за телесна тежина, јога и ленти за отпор можат да бидат корисни.\n" +
                "Аеробни вежби: физичка активност што прави да дишеме потешко, и ја подобрува работата на срцето и белите дробови. За некои лица со невромускулна состојба, ова може да биде потешко да се постигне како резултат на разни ограничувања, но придобивките за нашето срце и белодробно функционирање може да доаѓаат и од вежба заснована на сила.\n" +
                "Вежбата треба да биде вклучена во секојдневната активност на детето и да започне со мали периоди од 10-15 минути.\n" +
                "Физичката активност и движењето исто така треба да бидат забавни и дизајнирани преку игра да го зголемат уживањето за детето.",
                "https://exerciseright.com.au/wp-content/uploads/2019/02/ER-for-kids-condition-name-banner4.jpg");
        this.diseaseService.create("АДХД (синдромот на недостаток на внимание и хиперактивност)","Поединци со синдромот на недостаток на внимание и хиперактивност (АДХД) честопати се соочуваат со однесувањето и когнитивните предизвици, со докази кои покажуваат дека оние со АДХД може дури и да доживеат поголеми когнитивни придобивки од доза на вежбање отколку оние без АДХД.\n" +
                "Вежбањето има моќни ефекти врз функцијата и структурата на мозокот и може да биде ефикасно за лица со АДХД. Доказите сугерираат на позитивна поврзаност помеѓу зголемената физичка активност и симптомите на АДХД, особено подобрувањата во однесувањето и когнитивноста.\n" +
                "Во моментов, техниките за модификација на лекови и однесување најчесто се користат за управување со симптомите на АДХД. Физичката активност и вежбањето можат да помогнат во поддршката на овие третмани и можат да имаат повеќе придобивки за физичкото и менталното здравје и благосостојба за децата со АДХД.\n" +
                "ЗОШТО Е ВАЖНО ДА СЕ ВЕЖБА?\n" +
                " Механизмот зад улогата на вежбање кај младите луѓе со АДХД може да се должи на промените во структурата на мозокот, подобрените невротрансмитери и регулативата за возбуда што ја промовира вежбата. Вежбањето може да влијае на симптомите на АДХД со зголемување на достапноста на одреден невротрансмитер во мозокот. Истражувањата сугерираат дека вежбањето природно го стимулира мозокот на сличен начин како и лековите кои најчесто се користат.\n" +
                "Вежбањето исто така може да биде особено ефикасно за младите луѓе кои се борат со лекови и / или интервенции во однесувањето, бидејќи вежбањето исто така доаѓа без негативни несакани ефекти.\n" +
                "Младите луѓе кои имаат АДХД честопати можат да доживеат намалување на извршната функција (работна меморија), инхибиција на однесувањето, активност насочена кон целите и емоционална регулација. Редовна, умерена до енергична физичка активност и вежбање е откриено дека се поврзани со следниве когнитивни придобивки:\n" +
                "Подобрена брзина на обработка на мозокот\n" +
                "Работна меморија\n" +
                "Поголема способност за планирање и решавање проблеми\n" +
                "Намалена импулсивност\n" +
                "Намалена вознемиреност\n" +
                "Подобрено внимание\n" +
                " Слично на ефектите од лековите, когнитивните процеси и однесување се враќаат на нивоата пред вежбање откако ќе поминат ефектите предизвикани од вежбање врз централниот нервен систем. Доказите сугерираат дека и когнитивните перформанси и складирањето и враќањето на меморијата може да се подобрат веднаш по вежбањето.\n" +
                "Работи што треба да се запомнат:\n" +
                " Младите луѓе со АДХД честопати имаат помала веројатност да учествуваат во организиран спорт и редовна физичка активност4. Ова може да се должи на низа причини, почнувајќи од потешкотии поврзани со симптоми на АДХД, што може да го направи предизвик вклучувањето и учеството. Другите бариери може да вклучуваат намалена самодоверба или интерес како резултат на тешкотии при планирање на движењето или моторни вештини, кои се исто така чести кај лицата со АДХД. Која и да е причината, тие се изложени на ист ризик како и нивните врснички поврзани со возраста за мноштво негативни здравствени импликации поврзани со неактивност.\n" +
                "Од докази, ние знаеме дека младите луѓе со АДХД ќе ги видат истите придобивки во мускулниот капацитет, силата, аеробната кондиција, моторното планирање, развојот на моторните вештини и сл. Како и нивните врсници во согласност со возраста, што придонесува за зголемена самодоверба. Затоа, учеството во редовно вежбање може да има холистички ефект врз не само однесувањето и сознанието, туку можеме да забележиме подобрувања во други дефицити на вештини, како и подобрена физичка благосостојба.\n" +
                "ВИДОВИ ВЕЖБИ ПРЕПОРАЧАНИ:\n" +
                "Редовната разновидна вежба во која ужива младата личност треба да биде редовен дел од секојдневниот живот.\n" +
                "Младите луѓе со АДХД треба да учествуваат во најмалку 60 минути или повеќе вежбање на ден, и да го намалат своето дневно време на екранот во согласност со упатствата за физичка активност на Австралија за деца и адолесценти.\n" +
                " Учеството во спорт и структурирано вежбање може да ги насочи енергиите и да ги намали негативните однесувања.\n" +
                " Јогата 1-2 пати неделно може да помогне во регулирање на однесувањето. Позите, контролата на здивот, менталната концентрација и длабоката релаксација позитивно ќе влијаат на менталните состојби преку промовирање на самоконтрола, внимание и концентрација, самоефикасност, свесност за телото и намалување на стресот. Практиката на јога вежба предизвикува намалено активирање на симпатичкиот нервен систем (активна состојба) и зголемено активирање на парасимпатичкиот нервен систем (состојба на релаксација) што резултира во зголемена емоционална саморегулација.",
                "https://exerciseright.com.au/wp-content/uploads/2019/02/ER-for-kids-condition-name-banner2.jpg");
        this.diseaseService.create("Срцеви заболувања","Постојат многу различни срцеви заболувања и кардиоваскуларни болести кои можат да влијаат на деца како што се срцеви немири, аритмии, вродени срцеви заболувања, перикардитис и висок крвен притисок.\n" +
                "Секоја состојба треба да се третира поинаку под професионално водство на медицински и сојузнички здравствени работници како што е акредитиран човек за вежбање.\n" +
                "ЗОШТО Е ВАЖНО ДА СЕ ВЕЖА?\n" +
                " Постојат многу различни срцеви состојби и важно е да побарате стручна помош пред да го охрабрите вашето дете да се движи повеќе. Без оглед на тоа каков вид на вежбање, постојат многу различни придобивки од вежбањето за деца со срцеви заболувања.\n" +
                "На пример, вежбањето може:\n" +
                "Помогнете му на вашето дете да развие навики за вежбање што ќе ги чува цел живот\n" +
                "Подобрување на нивното целокупно здравје и благосостојба\n" +
                "Зголемува густината на минералите во коските\n" +
                "Намалете го ризикот од атеросклероза\n" +
                "Намалете го ризикот од хипертензија\n" +
                "Помогнете им да стекнат самодоверба и да го подобрат менталното здравје\n" +
                "Работи што треба да се запомнат:\n" +
                " Најдобро би било да се избегнуваат контактни спортови и активности бидејќи тоа може да предизвика непотребен стрес кај некои деца.\n" +
                "Следењето на срцевиот ритам, крвниот притисок и нивото на кислород треба да се изврши пред, за време (доколку е потребно) и по вежбање од страна на професионалец за да бидете сигурни дека сè е на вистинскиот пат.\n" +
                "Пред секое започнување и ново вежбање треба да се изврши преглед и преглед на медицинска историја.\n" +
                "Енергичното вежбање треба да се избегнува без лекарски дозвола.\n" +
                "ВИДОВИ ВЕЖБИ ПРЕПОРАЧАНИ:\n" +
                " Обидете се и вклучете спортови и активности без контакт со блага до умерена стапка на напор. Неколку добри примери за ова би биле возење велосипед, пливање и излегување на прошетка со семејството.\n" +
                "Комбинирајте надгледувани аеробни и тренинзи за сила 2 до 3 пати неделно 40 минути.\n" +
                "Флексибилноста е исто така важна, затоа обидете се и охрабрувајте лесно истегнување пред и по физичката активност.",
                "https://exerciseright.com.au/wp-content/uploads/2017/01/Chronic-conditions-banner-Heart-Conditions.jpg");
        this.diseaseService.create("Церебрална парализа","Церебрална парализа е израз што се однесува на група нарушувања кои влијаат на способноста на лицето да се движи. Тоа се должи на оштетување на мозокот во развој или за време на бременоста или кратко време по раѓањето.\n" +
                "Церебралната парализа влијае на луѓето на различни начини и може да влијае на движењето на телото, контрола на мускулите, мускулна координација, тонус на мускулите, рефлекс, положба и рамнотежа. Иако церебралната парализа е трајна доживотна состојба, некои од овие знаци на церебрална парализа можат да се подобрат или влошат со текот на времето. \n" +
                "Луѓето кои имаат церебрална парализа, исто така, може да имаат оштетување на видот, учењето, слухот, говорот, епилепсијата и интелектуалното нарушување.\n" +
                "ЗОШТО Е ВАЖНО ДА СЕ ВЕЖБА?\n" +
                " Вежбањето е многу важно за подобрување на општото физичко и ментално здравје за секое дете со церебрална парализа. Исто така е важно да се напомене дека недостатокот на физичка активност може да доведе  и да го отежни движењето на уште потешко.\n" +
                "Децата со церебрална парализа можат да се соочат со бројни ограничувања на индивидуално ниво, затоа е од витално значење да се консултирате со акредитиран стручњак за вежбање за стручно водство.\n" +
                "Работи што треба да се запомнат:\n" +
                " Пред да ја зголемите или воведете некоја специфична физичка активност, консултирајте се со акредитиран човек за вежбање за стручно водство.\n" +
                "Важно е да бидете сигурни дека вашето дете е активно како што е физички можно.\n" +
                "Мотивацијата и охрабрувањето се неопходни за вашето дете поради тешкотиите што ги имаат при движењето.\n" +
                "Активностите треба да се фокусираат на зголемување на нивната општа кондиција, подобрување на нивната сила и подобрување на нивниот опсег на движење.\n" +
                "ВИДОВИ ВЕЖБИ ПРЕПОРАЧАНИ:\n" +
                " Кога работите со акредитиран човек за вежбање, тие ќе користат различни различни техники, вклучувајќи предизвици и игри, игри со инвалидска количка и велосипедизам, пливање и други активности базирани на вода преку вежби за работа и отпор.",
                "https://exerciseright.com.au/wp-content/uploads/2017/01/Chronic-conditions-banner-Cerebral-Palsy.jpg");
        this.diseaseService.create("Канцер","Вежбањето е важно за долгорочно здравје и развој кај преживеаните од рак во детството и адолесцентот.\n" +
                "Третманите за карцином често се придружени со неколку доцни негативни ефекти (ЛАЕ), кои имаат потенцијал да придонесат за развој на хронични заболувања. Заедничката ЛАЕ може да вклучува нарушен раст, когнитивна дисфункција, компромитирана кардиопулмонална и метаболичка функција, како и нарушувања на мускулно-скелетот.\n" +
                "Клиничкото здружение за онкологија во Австралија (COSA) препорачува дека вежбањето треба да биде дел од стандардната пракса во грижата за карцином и е безбедна и ефективна интервенција за спротивставување на многу негативни физички и психолошки ефекти на ракот и неговото лекување. Во минатото, и на младите и на возрасните им се препорачува да се опорават во кревет и да се одморат што е можно повеќе. Тековните препораки го охрабруваат вежбањето да започне кратко време по третманот.\n" +
                "ЗОШТО Е ВАЖНО ДА СЕ ВЕЖБА\n" +
                " Физичката активност и вежбањето играат клучна улога и во физиолошкиот и во психолошкиот развој на младите. Доволно развиените моторни вештини преку вежбање играат клучна улога во детството за самодоверба, социјални способности, ниво на подготвеност и учество во рекреативни активности.\n" +
                "Прилагодени интервенции за вежбање од страна на акредитиран физиолог за вежбање (AEP) за да се зголеми нивото на физичка активност може да се подобри:\n" +
                "изгубена самодоверба\n" +
                "развој на моторни вештини (како скокање, свиткување, трчање, прескокнување)\n" +
                "физички дефицити како резултат на терапија со карцином (како што се мускулна болка и замор)\n" +
                "квалитетот на животот\n" +
                "физичко функционирање\n" +
                "вознемиреност\n" +
                "ризик од идни здравствени проблеми поврзани со рак или третман\n" +
                "охрабрување за социјализација (ангажирање и играње со пријатели)\n" +
                "Работи што треба да се запомнат:\n" +
                " Вежбата пропишана за деца и адолесценти преживеани од карцином треба да биде прилагодена на нивните индивидуални потреби, земајќи ги предвид нивоата на замор, целокупното неусогласување, рамнотежата, губењето на екстремитетите, несаканите ефекти на лековите и сл. , соодветен интензитет и мотивациска усогласеност.\n" +
                " Многумина ја губат самодовербата да се вратат на претходната физичка активност или училишен спорт поради намалена самодоверба, често поради тоа што веќе не биле толку способни или вешти и координирани како нивните врсници поради изгубеното време со третманот. Другите бариери може да вклучуваат намалено ниво на фитнес, физички замор и намалено уживање како резултат на засилен напор.\n" +
                " Поддршката на семејството негувател и родител / старател е важна за да му помогне на детето да ја врати својата доверба во враќањето на активност.\n" +
                "Учеството во вежбање и физичка активност со игра е одличен начин да им се овозможи на децата да имаат нешто што можат да го контролираат и уживаат, за да им помогне во подобрувањето на нивното здравје и резултати.\n" +
                "ВИДОВИ ВЕЖБИ ПРЕПОРАЧАНИ:\n" +
                "Децата треба да имаат за цел постепено да го зголемуваат нивото на активност со текот на времето, ова ќе помогне да се изгради толеранција за вежбање, а заморот ќе се намалува како што детето се движи повеќе.\n" +
                "Децата можат да учествуваат во 60 минути физичка активност на ден.\n" +
                "Вежбите за сила треба да се завршат 20 минути на 2 до 3 дена неделно за да се изградат разубавени мускули.\n" +
                "Вежби за флексибилност и движење, познати и како опсег на вежби за движење, треба да се завршуваат секој ден и пред и по физичката активност.\n" +
                "Децата треба да го ограничат времето на екран засновано на слободно време на 2 часа на ден.\n" +
                "Цел да се намали времето за седење во текот на денот; станете и движете се, облечете се и извршете ги сите нормални активности на грижа за себе и движење за да се вратите на здрав, среќен и активен живот.",
                "https://exerciseright.com.au/wp-content/uploads/2019/02/ER-for-kids-condition-name-banner.jpg");
    }
}
